Revit 2024 API
StructuralSectionGeneralS Constructor
 Creates a new instance of Round Bar shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionGeneralS(
	double diameter,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Visual Basic
Public Sub New ( _
	diameter As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	analysisParams As StructuralSectionAnalysisParams _
)
Visual C++
public:
StructuralSectionGeneralS(
	double diameter,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
Parameters
diameter
Type: System.Double
 Pipe Diameter.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
StructuralSectionGeneralS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace